app/controllers/restaurants_controller.rb

    def index
        restaurants=Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

    def show
        restaurant=Restaurant.find(params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def destroy
        restaurant=Restaurant.find(params[:id])
        restaurant.destroy
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 2]]