app/controllers/restaurant_pizzas_controller.rb

    def create
        restaurant_pizzas=RestaurantPizza.create!(passed_params)
---
INSERT INTO "restaurant_pizzas" ("price", "pizza_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["price", 23], ["pizza_id", 3], ["restaurant_id", 4], ["created_at", "2022-11-25 21:00:50.152358"], ["updated_at", "2022-11-25 21:00:50.152358"]]